from datetime import datetime
from random import randint

# Змінні з емоджі для твого проєкту
world = "🌍🌎🌏"
python = "Python 🐍"
fire = "🔥"

# Емоджі, які ти можеш скопіювати у свій код:
# 🎊 🙌 🙌🏼 🙌🏽 🙌🏾 🙌🏿 # 😃 🕒 🎨 🎮 🔬 🎉 🕶️ 🎲 😊
# 👩‍🦽 👩🏼‍🦽 👩🏽‍🦽 👩🏾‍🦽 👩🏿‍🦽 🧘 🧘🏼 🧘🏽 🧘🏾 🧘🏿 🙋 🙋🏼 🙋🏽 🙋🏾 🙋🏿
# 🦄 🚀 💯 ⭐ 💛 ❤️ 📚 ⚽ 🏏 🏀 🥋 🏆 ✨ 🥺 🌈 🔥 ♻️ 🌳

# Корисні символи :',()*_/.#


# Визначення функцій
def roll_dice():
    max = input("Кількість сторін кубика:")
    print(f"Цей кубик називається D {max}")
    roll = randint(1, int(max))
    print(f"Тобі випало число {roll} {fire * roll}")


# Нижче розмісти код, який потрібно виконати
print(f"Привіт, {world}")
print(f"Ласкаво просимо до {python}")
print(f"{python} знається на математиці!")
print(f"{3 * 9}")
print(f"Дата й час — {datetime.now()}")

roll_dice()  # Виклич функцію, яка кидає кубик
print(f"Я ❤️ веселку 🌈")
print(f"Єдинороги 🦄 викликають у мене 😃")
print(f"Я хочу написати оповідання 📖 за допомогою {python}")
