from datetime import datetime
from random import randint

# Змінні з емоджі для твого проєкту
world = '🌍🌎🌏'
python = 'Python 🐍'
fire = '🔥'

# Емоджі, які ти можеш скопіювати у свій код:
# 🎊 🙌 🙌🏼 🙌🏽 🙌🏾 🙌🏿 # 😃 🕒 🎨 🎮 🔬 🎉 🕶️ 🎲 😊
# 👩‍🦽 👩🏼‍🦽 👩🏽‍🦽 👩🏾‍🦽 👩🏿‍🦽 🧘 🧘🏼 🧘🏽 🧘🏾 🧘🏿 🙋 🙋🏼 🙋🏽 🙋🏾 🙋🏿
# 🦄 🚀 💯 ⭐ 💛 ❤️ 📚 ⚽ 🏏 🏀 🥋 🏆 ✨ 🥺 🌈 🔥 ♻️ 🌳

# Корисні символи :',()*_/.#

# Визначення функцій
def roll_dice():
    max = input('Кількість сторін кубика:')  # Чекай, доки користувач введе дані
    print('Цей кубик називається D', max)  # Використай число, введене користувачем
    roll = randint(1, int(max))  # Використай змінну max, щоб вказати кількість сторін кубика
    print('Тобі випало число', roll, fire * roll)  # Повтори емоджі вогника стільки разів, скільки тобі випало на кубику

# Нижче розмісти код, який потрібно виконати
print('Привіт,', world)
print('Ласкаво просимо до', python)
print(python, 'знається на математиці!')
print(230 * 5782 ** 2 / 23781)  # Виведи результат розрахунків
print('Дата й час —', datetime.now())  # Виведи поточну дату й час

roll_dice()  # Виклич функцію, яка кидає кубик
print('Я ❤️ веселку 🌈')
print('Єдинороги 🦄 викликають у мене 😃')
print('Я хочу написати оповідання 📖 за допомогою', python)
