from datetime import datetime
from random import randint

# Emoji variables to use in your project
world = '🌍🌎🌏'
python = 'Python 🐍'
fire = '🔥'

# Emojis to copy and paste into your code:
# 🎊 🙌 🙌🏼 🙌🏽 🙌🏾 🙌🏿 # 😃 🕒 🎨 🎮 🔬 🎉 🕶️ 🎲 😊
# 👩‍🦽 👩🏼‍🦽 👩🏽‍🦽 👩🏾‍🦽 👩🏿‍🦽 🧘 🧘🏼 🧘🏽 🧘🏾 🧘🏿 🙋 🙋🏼 🙋🏽 🙋🏾 🙋🏿
# 🦄 🚀 💯 ⭐ 💛 ❤️ 📚 ⚽ 🏏 🏀 🥋 🏆 ✨ 🥺 🌈 🔥 ♻️ 🌳

# Useful characters :',()*_/.#

# फ़ंक्शन परिभाषाएँ
डीईएफ़ रोल_डाइस():
    अधिकतम = इनपुट('कितनी भुजाएँ?:') # उपयोगकर्ता से इनपुट की प्रतीक्षा करें
    प्रिंट('वह\'सा डी', अधिकतम) # उपयोगकर्ता द्वारा दर्ज किए गए नंबर का उपयोग करें
    रोल = रैंडिंट(1, int(max)) # पासे की भुजाओं की संख्या निर्धारित करने के लिए max का उपयोग करें
    प्रिंट करें ('आपने रोल किया', रोल, फायर * रोल) # पासा रोल से मिलान करने के लिए फायर इमोजी को दोहराएं

यहां चलाने के लिए कोड डालें
print('Hello', world)
प्रिंट ('आपका स्वागत है', पायथन)
प्रिंट (पायथन, 'गणित में बहुत अच्छा है!')
प्रिंट(230 * 5782 ** 2/23781) # योग का परिणाम प्रिंट करें
प्रिंट('दिनांक और समय है', datetime.now()) # वर्तमान दिनांक और समय प्रिंट करें

रोल_डाइस() # रोल पासा फ़ंक्शन को कॉल करें
प्रिंट('मैं ❤️ इंद्रधनुष 🌈')
प्रिंट करें ('यूनिकॉर्न 🦄 मुझे बनाते हैं 😃')
प्रिंट ('मैं इसके साथ एक कहानी बनाना चाहता हूं', पायथन)
