from datetime import datetime
from random import randint

# अपने प्रोजेक्ट में उपयोग करने के लिए इमोजी वेरिएबल
दुनिया = '🌍🌎🌏'
अजगर = 'पायथन 🐍'
आग = "🔥"

# अपने कोड में कॉपी और पेस्ट करने के लिए इमोजी:
# 🎊 🙌 🙌🏼 🙌🏽 🙌🏾 🙌🏿 # 😃 🕒 🎨 🎮 🔬 🎉 🕶️ 🎲 😊
# 👩‍🦽 👩🏼‍🦽 👩🏽‍🦽 👩🏾‍🦽 👩🏿‍🦽 🧘 🧘🏼 🧘🏽 🧘🏾 🧘🏿 🙋 🙋🏼 🙋🏽 🙋🏾 🙋🏿
# 🦄 🚀 💯 ⭐ 💛 ❤️ 📚 ⚽ 🏏 🏀 🥋 🏆 ✨ 🥺 🌈 🔥 ♻️ 🌳

# उपयोगी वर्ण :',()*_/.#


# फ़ंक्शन परिभाषाएँ फंक्शन

डिफ़ रोल_डाइस():
    max = input("कितनी भुजाएँ?:") # उपयोगकर्ता से इनपुट की प्रतीक्षा करें
    print("वह D है", max) # उपयोगकर्ता द्वारा दर्ज की गई संख्या का उपयोग करें
    रोल = रैंडिंट (1, इंट (मैक्स)) # पासे की भुजाओं की संख्या निर्धारित करने के लिए अधिकतम का उपयोग करें
    print(
        "आपने रोल किया", रोल, आग * रोल
    ) # पासा रोल से मिलान करने के लिए आग इमोजी को दोहराएं


यहां चलाने के लिए कोड डालें
प्रिंट("नमस्ते", दुनिया)
प्रिंट("आपका स्वागत है", पायथन)
प्रिंट(पायथन, "गणित में बहुत अच्छा है!")
print(230 * 5782**2 / 23781) # योग का परिणाम प्रिंट करें
print("दिनांक और समय है", datetime.now()) # वर्तमान दिनांक और समय प्रिंट करें

roll_dice() # रोल डाइस फ़ंक्शन को कॉल करें
प्रिंट('मैं ❤️ इंद्रधनुष 🌈")
प्रिंट("यूनिकॉर्न 🦄 मुझे 😃 बनाते हैं")
प्रिंट ('मैं इसके साथ एक कहानी बनाना चाहता हूं', पायथन)
