from datetime import datetime
from random import randint

# अपने प्रोजेक्ट में उपयोग करने के लिए इमोजी वेरिएबल
दुनिया = '🌍🌎🌏'
अजगर = 'पायथन 🐍'
आग = "🔥"

# अपने कोड में कॉपी और पेस्ट करने के लिए इमोजी:
# 🎊 🙌 🙌🏼 🙌🏽 🙌🏾 🙌🏿 # 😃 🕒 🎨 🎮 🔬 🎉 🕶️ 🎲 😊
# 👩‍🦽 👩🏼‍🦽 👩🏽‍🦽 👩🏾‍🦽 👩🏿‍🦽 🧘 🧘🏼 🧘🏽 🧘🏾 🧘🏿 🙋 🙋🏼 🙋🏽 🙋🏾 🙋🏿
# 🦄 🚀 💯 ⭐ 💛 ❤️ 📚 ⚽ 🏏 🏀 🥋 🏆 ✨ 🥺 🌈 🔥 ♻️ 🌳

# उपयोगी वर्ण :',()*_/.#


# फ़ंक्शन परिभाषाएँ फंक्शन

डिफ़ रोल_डाइस():
    max = input("How many sides on your dice?:")
    print(f"That is a D {max}")
    roll = randint(1, int(max))
    print(f"You rolled a {roll} {fire * roll}")


यहां चलाने के लिए कोड डालें
print(f"Hello {world}")
print(f"Welcome to {python}")
print(f"{python} is good at maths!")
print(f"{3 * 9}")
print(f"The date and time is {datetime.now()}")

roll_dice() # रोल डाइस फ़ंक्शन को कॉल करें
print(f"I ❤️ rainbows 🌈")
print(f"Unicorns 🦄 make me 😃")
print(f"I'd like to make a story 📖 with {python}")
