from datetime import datetime
from random import randint

# अपने प्रोजेक्ट में उपयोग करने के लिए इमोजी वेरिएबल
दुनिया = '🌍🌎🌏'
अजगर = 'पायथन 🐍'
आग = "🔥"

# अपने कोड में कॉपी और पेस्ट करने के लिए इमोजी:
# 🎊 🙌 🙌🏼 🙌🏽 🙌🏾 🙌🏿 # 😃 🕒 🎨 🎮 🔬 🎉 🕶️ 🎲 😊
# 👩‍🦽 👩🏼‍🦽 👩🏽‍🦽 👩🏾‍🦽 👩🏿‍🦽 🧘 🧘🏼 🧘🏽 🧘🏾 🧘🏿 🙋 🙋🏼 🙋🏽 🙋🏾 🙋🏿
# 🦄 🚀 💯 ⭐ 💛 ❤️ 📚 ⚽ 🏏 🏀 🥋 🏆 ✨ 🥺 🌈 🔥 ♻️ 🌳

# उपयोगी वर्ण :',()*_/.#


# फ़ंक्शन परिभाषाएँ फंक्शन

डिफ़ रोल_डाइस():
    अधिकतम = इनपुट("आपके पासे में कितनी भुजाएँ हैं?:")
    प्रिंट(f"यह एक D {max}है")
    रोल = रैंडिंट(1, int(max))
    प्रिंट(f"आपने {roll} {आग * रोल} रोल किया")


यहां चलाने के लिए कोड डालें
प्रिंट(f"हैलो {world}")
print(f" {python}में आपका स्वागत है")
print(f"{python} गणित में अच्छा है!")
print(f"{3 * 9}")
print(f"दिनांक और समय {datetime.now()} है")

roll_dice() # रोल डाइस फ़ंक्शन को कॉल करें
print(f"मुझे इंद्रधनुष 🌈 पसंद हैं")
print(f"यूनिकॉर्न 🦄 मुझे 😃 बनाते हैं")
print(f"मैं {python}के साथ एक कहानी 📖 बनाना चाहता हूँ")
